Revit 2027 API
EdgeEndPoint.Equals(EdgeEndPoint) Method
 Determines whether this EdgeEndPoint is equal to another.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Equals(
	EdgeEndPoint other
)
Public Function Equals (
	other As EdgeEndPoint
) As Boolean
public:
bool Equals(
	EdgeEndPoint^ other
)
member Equals :
        other : EdgeEndPoint -> bool
Parameters
other EdgeEndPoint
 The EdgeEndPoint with which to compare this EdgeEndPoint.
Return Value
Boolean
 True if the given EdgeEndPoint is equal to this one, otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EdgeEndPoint Class
Equals Overload
Autodesk.Revit.DB Namespace